Revit 2024 API
DocumentCreatingEventArgs.Template Property
 The template file path to be used for creating the new document.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2010
Syntax
C#
public string Template { get; }
Visual Basic
Public ReadOnly Property Template As String
	Get
Visual C++
public:
property String^ Template {
	String^ get ();
}
See Also
DocumentCreatingEventArgs Class
Autodesk.Revit.DB.Events Namespace